perf/results/single-node/load/cfg-load-ping.yaml
config:
  environments:
    ping:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Slow Ramp # used by slow endpoints
      duration: 45   # seconds
      arrivalRate: 10
      rampTo: 450
    - name: Plain Line
      duration: 600
      arrivalRate: 450
    - name: Reduce Line 1
      duration: 10
      arrivalRate: 300
    - name: Reduce Line 2
      duration: 10
      arrivalRate: 200
    - name: Reduce Line 3
      duration: 10
      arrivalRate: 100 
    - name: Reduce Line 4
      duration: 10
      arrivalRate: 50
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 60
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'